zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32a503v(b-c-d)xx-pinctrl.h
/* CK_OUT */
#define CK_OUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF0)
#define CK_OUT_PC13 \
	GD32_PINMUX_AF('C', 13, AF0)

/* CK_OUT0 */
#define CK_OUT0_PA1 \
	GD32_PINMUX_AF('A', 1, AF0)

/* CMP_OUT */
#define CMP_OUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF7)
#define CMP_OUT_PF2 \
	GD32_PINMUX_AF('F', 2, AF7)

/* DAC_OUT */
#define DAC_OUT_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF9)
#define EVENTOUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF9)
#define EVENTOUT_PA2 \
	GD32_PINMUX_AF('A', 2, AF9)
#define EVENTOUT_PA3 \
	GD32_PINMUX_AF('A', 3, AF9)
#define EVENTOUT_PA4 \
	GD32_PINMUX_AF('A', 4, AF9)
#define EVENTOUT_PA5 \
	GD32_PINMUX_AF('A', 5, AF9)
#define EVENTOUT_PA7 \
	GD32_PINMUX_AF('A', 7, AF9)
#define EVENTOUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF9)
#define EVENTOUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF9)
#define EVENTOUT_PA10 \
	GD32_PINMUX_AF('A', 10, AF9)
#define EVENTOUT_PA11 \
	GD32_PINMUX_AF('A', 11, AF9)
#define EVENTOUT_PA12 \
	GD32_PINMUX_AF('A', 12, AF9)
#define EVENTOUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF9)
#define EVENTOUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF9)
#define EVENTOUT_PA15 \
	GD32_PINMUX_AF('A', 15, AF9)
#define EVENTOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF9)
#define EVENTOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF9)
#define EVENTOUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF9)
#define EVENTOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF9)
#define EVENTOUT_PB4 \
	GD32_PINMUX_AF('B', 4, AF9)
#define EVENTOUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF9)
#define EVENTOUT_PB6 \
	GD32_PINMUX_AF('B', 6, AF9)
#define EVENTOUT_PB7 \
	GD32_PINMUX_AF('B', 7, AF9)
#define EVENTOUT_PB8 \
	GD32_PINMUX_AF('B', 8, AF9)
#define EVENTOUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF9)
#define EVENTOUT_PB10 \
	GD32_PINMUX_AF('B', 10, AF9)
#define EVENTOUT_PB11 \
	GD32_PINMUX_AF('B', 11, AF9)
#define EVENTOUT_PB12 \
	GD32_PINMUX_AF('B', 12, AF9)
#define EVENTOUT_PB13 \
	GD32_PINMUX_AF('B', 13, AF9)
#define EVENTOUT_PB14 \
	GD32_PINMUX_AF('B', 14, AF9)
#define EVENTOUT_PB15 \
	GD32_PINMUX_AF('B', 15, AF9)
#define EVENTOUT_PC0 \
	GD32_PINMUX_AF('C', 0, AF9)
#define EVENTOUT_PC1 \
	GD32_PINMUX_AF('C', 1, AF9)
#define EVENTOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF9)
#define EVENTOUT_PC3 \
	GD32_PINMUX_AF('C', 3, AF9)
#define EVENTOUT_PC4 \
	GD32_PINMUX_AF('C', 4, AF9)
#define EVENTOUT_PC5 \
	GD32_PINMUX_AF('C', 5, AF9)
#define EVENTOUT_PC6 \
	GD32_PINMUX_AF('C', 6, AF9)
#define EVENTOUT_PC7 \
	GD32_PINMUX_AF('C', 7, AF9)
#define EVENTOUT_PC8 \
	GD32_PINMUX_AF('C', 8, AF9)
#define EVENTOUT_PC9 \
	GD32_PINMUX_AF('C', 9, AF9)
#define EVENTOUT_PC10 \
	GD32_PINMUX_AF('C', 10, AF9)
#define EVENTOUT_PC11 \
	GD32_PINMUX_AF('C', 11, AF9)
#define EVENTOUT_PC12 \
	GD32_PINMUX_AF('C', 12, AF9)
#define EVENTOUT_PC13 \
	GD32_PINMUX_AF('C', 13, AF9)
#define EVENTOUT_PC14 \
	GD32_PINMUX_AF('C', 14, AF9)
#define EVENTOUT_PC15 \
	GD32_PINMUX_AF('C', 15, AF9)
#define EVENTOUT_PD0 \
	GD32_PINMUX_AF('D', 0, AF9)
#define EVENTOUT_PD1 \
	GD32_PINMUX_AF('D', 1, AF9)
#define EVENTOUT_PD2 \
	GD32_PINMUX_AF('D', 2, AF9)
#define EVENTOUT_PD3 \
	GD32_PINMUX_AF('D', 3, AF9)
#define EVENTOUT_PD4 \
	GD32_PINMUX_AF('D', 4, AF9)
#define EVENTOUT_PD5 \
	GD32_PINMUX_AF('D', 5, AF9)
#define EVENTOUT_PD6 \
	GD32_PINMUX_AF('D', 6, AF9)
#define EVENTOUT_PD7 \
	GD32_PINMUX_AF('D', 7, AF9)
#define EVENTOUT_PD8 \
	GD32_PINMUX_AF('D', 8, AF9)
#define EVENTOUT_PD9 \
	GD32_PINMUX_AF('D', 9, AF9)
#define EVENTOUT_PD10 \
	GD32_PINMUX_AF('D', 10, AF9)
#define EVENTOUT_PD11 \
	GD32_PINMUX_AF('D', 11, AF9)
#define EVENTOUT_PD12 \
	GD32_PINMUX_AF('D', 12, AF9)
#define EVENTOUT_PD13 \
	GD32_PINMUX_AF('D', 13, AF9)
#define EVENTOUT_PD14 \
	GD32_PINMUX_AF('D', 14, AF9)
#define EVENTOUT_PD15 \
	GD32_PINMUX_AF('D', 15, AF9)
#define EVENTOUT_PE0 \
	GD32_PINMUX_AF('E', 0, AF9)
#define EVENTOUT_PE1 \
	GD32_PINMUX_AF('E', 1, AF9)
#define EVENTOUT_PE2 \
	GD32_PINMUX_AF('E', 2, AF9)
#define EVENTOUT_PE3 \
	GD32_PINMUX_AF('E', 3, AF9)
#define EVENTOUT_PE4 \
	GD32_PINMUX_AF('E', 4, AF9)
#define EVENTOUT_PE5 \
	GD32_PINMUX_AF('E', 5, AF9)
#define EVENTOUT_PE6 \
	GD32_PINMUX_AF('E', 6, AF9)
#define EVENTOUT_PE7 \
	GD32_PINMUX_AF('E', 7, AF9)
#define EVENTOUT_PE8 \
	GD32_PINMUX_AF('E', 8, AF9)
#define EVENTOUT_PE9 \
	GD32_PINMUX_AF('E', 9, AF9)
#define EVENTOUT_PE10 \
	GD32_PINMUX_AF('E', 10, AF9)
#define EVENTOUT_PE11 \
	GD32_PINMUX_AF('E', 11, AF9)
#define EVENTOUT_PE12 \
	GD32_PINMUX_AF('E', 12, AF9)
#define EVENTOUT_PE13 \
	GD32_PINMUX_AF('E', 13, AF9)
#define EVENTOUT_PE14 \
	GD32_PINMUX_AF('E', 14, AF9)
#define EVENTOUT_PE15 \
	GD32_PINMUX_AF('E', 15, AF9)
#define EVENTOUT_PF0 \
	GD32_PINMUX_AF('F', 0, AF9)
#define EVENTOUT_PF1 \
	GD32_PINMUX_AF('F', 1, AF9)
#define EVENTOUT_PF2 \
	GD32_PINMUX_AF('F', 2, AF9)
#define EVENTOUT_PF3 \
	GD32_PINMUX_AF('F', 3, AF9)
#define EVENTOUT_PF4 \
	GD32_PINMUX_AF('F', 4, AF9)
#define EVENTOUT_PF5 \
	GD32_PINMUX_AF('F', 5, AF9)
#define EVENTOUT_PF6 \
	GD32_PINMUX_AF('F', 6, AF9)
#define EVENTOUT_PF7 \
	GD32_PINMUX_AF('F', 7, AF9)

/* I2C0_SCL */
#define I2C0_SCL_PA10 \
	GD32_PINMUX_AF('A', 10, AF3)
#define I2C0_SCL_PA14 \
	GD32_PINMUX_AF('A', 14, AF3)
#define I2C0_SCL_PC11 \
	GD32_PINMUX_AF('C', 11, AF3)
#define I2C0_SCL_PF6 \
	GD32_PINMUX_AF('F', 6, AF3)

/* I2C0_SDA */
#define I2C0_SDA_PA11 \
	GD32_PINMUX_AF('A', 11, AF3)
#define I2C0_SDA_PA13 \
	GD32_PINMUX_AF('A', 13, AF3)
#define I2C0_SDA_PC10 \
	GD32_PINMUX_AF('C', 10, AF3)
#define I2C0_SDA_PF7 \
	GD32_PINMUX_AF('F', 7, AF3)

/* I2C0_SMBA */
#define I2C0_SMBA_PA12 \
	GD32_PINMUX_AF('A', 12, AF3)
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AF('B', 5, AF3)

/* I2C1_SCL */
#define I2C1_SCL_PB7 \
	GD32_PINMUX_AF('B', 7, AF5)
#define I2C1_SCL_PD6 \
	GD32_PINMUX_AF('D', 6, AF5)
#define I2C1_SCL_PE10 \
	GD32_PINMUX_AF('E', 10, AF5)

/* I2C1_SDA */
#define I2C1_SDA_PB8 \
	GD32_PINMUX_AF('B', 8, AF5)
#define I2C1_SDA_PD7 \
	GD32_PINMUX_AF('D', 7, AF5)
#define I2C1_SDA_PE11 \
	GD32_PINMUX_AF('E', 11, AF5)

/* I2C1_SMBA */
#define I2C1_SMBA_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define I2C1_SMBA_PD11 \
	GD32_PINMUX_AF('D', 11, AF5)
#define I2C1_SMBA_PE12 \
	GD32_PINMUX_AF('E', 12, AF5)

/* I2S1_CK */
#define I2S1_CK_PC6 \
	GD32_PINMUX_AF('C', 6, AF4)
#define I2S1_CK_PE5 \
	GD32_PINMUX_AF('E', 5, AF4)

/* I2S1_MCK */
#define I2S1_MCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF4)
#define I2S1_MCK_PE6 \
	GD32_PINMUX_AF('E', 6, AF4)

/* I2S1_SD */
#define I2S1_SD_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)
#define I2S1_SD_PB6 \
	GD32_PINMUX_AF('B', 6, AF5)
#define I2S1_SD_PD14 \
	GD32_PINMUX_AF('D', 14, AF4)

/* I2S1_WS */
#define I2S1_WS_PA8 \
	GD32_PINMUX_AF('A', 8, AF4)
#define I2S1_WS_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define I2S1_WS_PD1 \
	GD32_PINMUX_AF('D', 1, AF4)
#define I2S1_WS_PD10 \
	GD32_PINMUX_AF('D', 10, AF4)
#define I2S1_WS_PD13 \
	GD32_PINMUX_AF('D', 13, AF4)

/* JTCK */
#define JTCK_PB8 \
	GD32_PINMUX_AF('B', 8, AF0)

/* JTDI */
#define JTDI_PB7 \
	GD32_PINMUX_AF('B', 7, AF0)

/* JTDO */
#define JTDO_PB4 \
	GD32_PINMUX_AF('B', 4, AF0)

/* JTMS */
#define JTMS_PB9 \
	GD32_PINMUX_AF('B', 9, AF0)

