zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32a503v(b-c-d)xx-pinctrl.h
/* MFCOM_D0 */
#define MFCOM_D0_PB4 \
	GD32_PINMUX_AF('B', 4, AF6)
#define MFCOM_D0_PE5 \
	GD32_PINMUX_AF('E', 5, AF6)
#define MFCOM_D0_PE7 \
	GD32_PINMUX_AF('E', 7, AF6)

/* MFCOM_D1 */
#define MFCOM_D1_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define MFCOM_D1_PE4 \
	GD32_PINMUX_AF('E', 4, AF6)
#define MFCOM_D1_PE8 \
	GD32_PINMUX_AF('E', 8, AF6)

/* MFCOM_D2 */
#define MFCOM_D2_PC11 \
	GD32_PINMUX_AF('C', 11, AF6)
#define MFCOM_D2_PE3 \
	GD32_PINMUX_AF('E', 3, AF12)

/* MFCOM_D3 */
#define MFCOM_D3_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)
#define MFCOM_D3_PE2 \
	GD32_PINMUX_AF('E', 2, AF6)

/* MFCOM_D4 */
#define MFCOM_D4_PA9 \
	GD32_PINMUX_AF('A', 9, AF6)
#define MFCOM_D4_PA11 \
	GD32_PINMUX_AF('A', 11, AF6)
#define MFCOM_D4_PC13 \
	GD32_PINMUX_AF('C', 13, AF6)

/* MFCOM_D5 */
#define MFCOM_D5_PA8 \
	GD32_PINMUX_AF('A', 8, AF6)
#define MFCOM_D5_PA10 \
	GD32_PINMUX_AF('A', 10, AF6)
#define MFCOM_D5_PE6 \
	GD32_PINMUX_AF('E', 6, AF6)

/* MFCOM_D6 */
#define MFCOM_D6_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define MFCOM_D6_PE1 \
	GD32_PINMUX_AF('E', 1, AF6)
#define MFCOM_D6_PF0 \
	GD32_PINMUX_AF('F', 0, AF7)

/* MFCOM_D7 */
#define MFCOM_D7_PA8 \
	GD32_PINMUX_AF('A', 8, AF5)
#define MFCOM_D7_PC15 \
	GD32_PINMUX_AF('C', 15, AF7)
#define MFCOM_D7_PE0 \
	GD32_PINMUX_AF('E', 0, AF6)

/* NJTRST */
#define NJTRST_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* SPI0_IO2 */
#define SPI0_IO2_PB3 \
	GD32_PINMUX_AF('B', 3, AF4)
#define SPI0_IO2_PE15 \
	GD32_PINMUX_AF('E', 15, AF4)

/* SPI0_IO3 */
#define SPI0_IO3_PB4 \
	GD32_PINMUX_AF('B', 4, AF4)
#define SPI0_IO3_PB10 \
	GD32_PINMUX_AF('B', 10, AF4)

/* SPI0_MISO */
#define SPI0_MISO_PB5 \
	GD32_PINMUX_AF('B', 5, AF4)
#define SPI0_MISO_PE13 \
	GD32_PINMUX_AF('E', 13, AF4)
#define SPI0_MISO_PF5 \
	GD32_PINMUX_AF('F', 5, AF4)

/* SPI0_MOSI */
#define SPI0_MOSI_PA2 \
	GD32_PINMUX_AF('A', 2, AF4)
#define SPI0_MOSI_PB13 \
	GD32_PINMUX_AF('B', 13, AF4)
#define SPI0_MOSI_PD4 \
	GD32_PINMUX_AF('D', 4, AF4)

/* SPI0_NSS */
#define SPI0_NSS_PA1 \
	GD32_PINMUX_AF('A', 1, AF4)
#define SPI0_NSS_PB14 \
	GD32_PINMUX_AF('B', 14, AF3)
#define SPI0_NSS_PD2 \
	GD32_PINMUX_AF('D', 2, AF4)
#define SPI0_NSS_PD3 \
	GD32_PINMUX_AF('D', 3, AF4)

/* SPI0_SCK */
#define SPI0_SCK_PB6 \
	GD32_PINMUX_AF('B', 6, AF4)
#define SPI0_SCK_PC0 \
	GD32_PINMUX_AF('C', 0, AF4)
#define SPI0_SCK_PE14 \
	GD32_PINMUX_AF('E', 14, AF4)

/* SPI1_MISO */
#define SPI1_MISO_PD15 \
	GD32_PINMUX_AF('D', 15, AF4)
#define SPI1_MISO_PE4 \
	GD32_PINMUX_AF('E', 4, AF4)

/* SPI1_MOSI */
#define SPI1_MOSI_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)
#define SPI1_MOSI_PB6 \
	GD32_PINMUX_AF('B', 6, AF5)
#define SPI1_MOSI_PD14 \
	GD32_PINMUX_AF('D', 14, AF4)

/* SPI1_NSS */
#define SPI1_NSS_PA8 \
	GD32_PINMUX_AF('A', 8, AF4)
#define SPI1_NSS_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)
#define SPI1_NSS_PD1 \
	GD32_PINMUX_AF('D', 1, AF4)
#define SPI1_NSS_PD10 \
	GD32_PINMUX_AF('D', 10, AF4)
#define SPI1_NSS_PD13 \
	GD32_PINMUX_AF('D', 13, AF4)

/* SPI1_SCK */
#define SPI1_SCK_PC6 \
	GD32_PINMUX_AF('C', 6, AF4)
#define SPI1_SCK_PE5 \
	GD32_PINMUX_AF('E', 5, AF4)

/* SWCLK */
#define SWCLK_PB8 \
	GD32_PINMUX_AF('B', 8, AF0)

/* SWDIO */
#define SWDIO_PB9 \
	GD32_PINMUX_AF('B', 9, AF0)

/* TIMER0_BRKIN0 */
#define TIMER0_BRKIN0_PA8 \
	GD32_PINMUX_AF('A', 8, AF1)
#define TIMER0_BRKIN0_PD5 \
	GD32_PINMUX_AF('D', 5, AF7)
#define TIMER0_BRKIN0_PF2 \
	GD32_PINMUX_AF('F', 2, AF1)

/* TIMER0_BRKIN1 */
#define TIMER0_BRKIN1_PD10 \
	GD32_PINMUX_AF('D', 10, AF2)
#define TIMER0_BRKIN1_PF1 \
	GD32_PINMUX_AF('F', 1, AF1)

/* TIMER0_BRKIN2 */
#define TIMER0_BRKIN2_PD9 \
	GD32_PINMUX_AF('D', 9, AF2)
#define TIMER0_BRKIN2_PF4 \
	GD32_PINMUX_AF('F', 4, AF2)

/* TIMER0_BRKIN3 */
#define TIMER0_BRKIN3_PC9 \
	GD32_PINMUX_AF('C', 9, AF1)
#define TIMER0_BRKIN3_PF3 \
	GD32_PINMUX_AF('F', 3, AF2)

/* TIMER0_CH0 */
#define TIMER0_CH0_PB2 \
	GD32_PINMUX_AF('B', 2, AF1)
#define TIMER0_CH0_PC0 \
	GD32_PINMUX_AF('C', 0, AF1)
#define TIMER0_CH0_PC8 \
	GD32_PINMUX_AF('C', 8, AF1)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA4 \
	GD32_PINMUX_AF('A', 4, AF1)
#define TIMER0_CH1_PC6 \
	GD32_PINMUX_AF('C', 6, AF1)
#define TIMER0_CH1_PE5 \
	GD32_PINMUX_AF('E', 5, AF1)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)
#define TIMER0_CH2_PD14 \
	GD32_PINMUX_AF('D', 14, AF1)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER0_CH3_PD12 \
	GD32_PINMUX_AF('D', 12, AF1)

/* TIMER0_MCH0 */
#define TIMER0_MCH0_PB1 \
	GD32_PINMUX_AF('B', 1, AF1)
#define TIMER0_MCH0_PC7 \
	GD32_PINMUX_AF('C', 7, AF1)
#define TIMER0_MCH0_PF5 \
	GD32_PINMUX_AF('F', 5, AF1)

/* TIMER0_MCH1 */
#define TIMER0_MCH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)
#define TIMER0_MCH1_PD15 \
	GD32_PINMUX_AF('D', 15, AF1)
#define TIMER0_MCH1_PE4 \
	GD32_PINMUX_AF('E', 4, AF1)

/* TIMER0_MCH2 */
#define TIMER0_MCH2_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER0_MCH2_PD13 \
	GD32_PINMUX_AF('D', 13, AF1)

/* TIMER0_MCH3 */
#define TIMER0_MCH3_PC1 \
	GD32_PINMUX_AF('C', 1, AF1)
#define TIMER0_MCH3_PD11 \
	GD32_PINMUX_AF('D', 11, AF1)

/* TIMER19_BRKIN0 */
#define TIMER19_BRKIN0_PC14 \
	GD32_PINMUX_AF('C', 14, AF2)

/* TIMER19_BRKIN1 */
#define TIMER19_BRKIN1_PA7 \
	GD32_PINMUX_AF('A', 7, AF3)
#define TIMER19_BRKIN1_PF1 \
	GD32_PINMUX_AF('F', 1, AF2)

/* TIMER19_BRKIN2 */
#define TIMER19_BRKIN2_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER19_BRKIN2_PE8 \
	GD32_PINMUX_AF('E', 8, AF2)

/* TIMER19_BRKIN3 */
#define TIMER19_BRKIN3_PA5 \
	GD32_PINMUX_AF('A', 5, AF2)
#define TIMER19_BRKIN3_PE7 \
	GD32_PINMUX_AF('E', 7, AF2)

/* TIMER19_CH0 */
#define TIMER19_CH0_PB0 \
	GD32_PINMUX_AF('B', 0, AF1)
#define TIMER19_CH0_PB7 \
	GD32_PINMUX_AF('B', 7, AF1)
#define TIMER19_CH0_PC5 \
	GD32_PINMUX_AF('C', 5, AF2)
#define TIMER19_CH0_PC11 \
	GD32_PINMUX_AF('C', 11, AF2)
#define TIMER19_CH0_PD6 \
	GD32_PINMUX_AF('D', 6, AF2)
#define TIMER19_CH0_PE5 \
	GD32_PINMUX_AF('E', 5, AF2)

/* TIMER19_CH1 */
#define TIMER19_CH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)
#define TIMER19_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)
#define TIMER19_CH1_PC4 \
	GD32_PINMUX_AF('C', 4, AF1)
#define TIMER19_CH1_PC15 \
	GD32_PINMUX_AF('C', 15, AF2)
#define TIMER19_CH1_PD7 \
	GD32_PINMUX_AF('D', 7, AF2)
#define TIMER19_CH1_PF0 \
	GD32_PINMUX_AF('F', 0, AF1)

/* TIMER19_CH2 */
#define TIMER19_CH2_PC3 \
	GD32_PINMUX_AF('C', 3, AF1)
#define TIMER19_CH2_PC13 \
	GD32_PINMUX_AF('C', 13, AF1)

/* TIMER19_CH3 */
#define TIMER19_CH3_PB10 \
	GD32_PINMUX_AF('B', 10, AF2)
#define TIMER19_CH3_PE3 \
	GD32_PINMUX_AF('E', 3, AF0)

/* TIMER19_MCH0 */
#define TIMER19_MCH0_PC5 \
	GD32_PINMUX_AF('C', 5, AF1)
#define TIMER19_MCH0_PC11 \
	GD32_PINMUX_AF('C', 11, AF1)
#define TIMER19_MCH0_PE4 \
	GD32_PINMUX_AF('E', 4, AF2)

