zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32a503v(b-c-d)xx-pinctrl.h
/* TIMER19_MCH1 */
#define TIMER19_MCH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TIMER19_MCH1_PC15 \
	GD32_PINMUX_AF('C', 15, AF1)

/* TIMER19_MCH2 */
#define TIMER19_MCH2_PC2 \
	GD32_PINMUX_AF('C', 2, AF1)
#define TIMER19_MCH2_PE6 \
	GD32_PINMUX_AF('E', 6, AF2)

/* TIMER19_MCH3 */
#define TIMER19_MCH3_PE2 \
	GD32_PINMUX_AF('E', 2, AF2)
#define TIMER19_MCH3_PE15 \
	GD32_PINMUX_AF('E', 15, AF2)

/* TIMER1_CH0 */
#define TIMER1_CH0_PE6 \
	GD32_PINMUX_AF('E', 6, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)

/* TIMER1_CH2 */
#define TIMER1_CH2_PB14 \
	GD32_PINMUX_AF('B', 14, AF1)
#define TIMER1_CH2_PD4 \
	GD32_PINMUX_AF('D', 4, AF2)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)
#define TIMER1_CH3_PB11 \
	GD32_PINMUX_AF('B', 11, AF2)

/* TIMER1_ETI */
#define TIMER1_ETI_PE6 \
	GD32_PINMUX_AF('E', 6, AF1)

/* TIMER20_BRKIN0 */
#define TIMER20_BRKIN0_PD11 \
	GD32_PINMUX_AF('D', 11, AF2)
#define TIMER20_BRKIN0_PD12 \
	GD32_PINMUX_AF('D', 12, AF2)

/* TIMER20_BRKIN1 */
#define TIMER20_BRKIN1_PC7 \
	GD32_PINMUX_AF('C', 7, AF2)
#define TIMER20_BRKIN1_PD5 \
	GD32_PINMUX_AF('D', 5, AF12)

/* TIMER20_BRKIN2 */
#define TIMER20_BRKIN2_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)
#define TIMER20_BRKIN2_PE0 \
	GD32_PINMUX_AF('E', 0, AF1)

/* TIMER20_BRKIN3 */
#define TIMER20_BRKIN3_PC9 \
	GD32_PINMUX_AF('C', 9, AF2)
#define TIMER20_BRKIN3_PE1 \
	GD32_PINMUX_AF('E', 1, AF1)

/* TIMER20_CH0 */
#define TIMER20_CH0_PA11 \
	GD32_PINMUX_AF('A', 11, AF1)
#define TIMER20_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)

/* TIMER20_CH1 */
#define TIMER20_CH1_PA13 \
	GD32_PINMUX_AF('A', 13, AF1)
#define TIMER20_CH1_PD0 \
	GD32_PINMUX_AF('D', 0, AF1)

/* TIMER20_CH2 */
#define TIMER20_CH2_PA9 \
	GD32_PINMUX_AF('A', 9, AF1)
#define TIMER20_CH2_PB12 \
	GD32_PINMUX_AF('B', 12, AF1)

/* TIMER20_CH3 */
#define TIMER20_CH3_PB10 \
	GD32_PINMUX_AF('B', 10, AF1)
#define TIMER20_CH3_PD4 \
	GD32_PINMUX_AF('D', 4, AF1)

/* TIMER20_MCH0 */
#define TIMER20_MCH0_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)
#define TIMER20_MCH0_PA14 \
	GD32_PINMUX_AF('A', 14, AF1)

/* TIMER20_MCH1 */
#define TIMER20_MCH1_PA12 \
	GD32_PINMUX_AF('A', 12, AF1)
#define TIMER20_MCH1_PC12 \
	GD32_PINMUX_AF('C', 12, AF1)

/* TIMER20_MCH2 */
#define TIMER20_MCH2_PA8 \
	GD32_PINMUX_AF('A', 8, AF2)
#define TIMER20_MCH2_PB11 \
	GD32_PINMUX_AF('B', 11, AF1)

/* TIMER20_MCH3 */
#define TIMER20_MCH3_PD3 \
	GD32_PINMUX_AF('D', 3, AF1)
#define TIMER20_MCH3_PE15 \
	GD32_PINMUX_AF('E', 15, AF1)

/* TIMER7_BRKIN0 */
#define TIMER7_BRKIN0_PD5 \
	GD32_PINMUX_AF('D', 5, AF12)
#define TIMER7_BRKIN0_PD8 \
	GD32_PINMUX_AF('D', 8, AF2)

/* TIMER7_BRKIN1 */
#define TIMER7_BRKIN1_PB5 \
	GD32_PINMUX_AF('B', 5, AF2)
#define TIMER7_BRKIN1_PB15 \
	GD32_PINMUX_AF('B', 15, AF2)

/* TIMER7_BRKIN2 */
#define TIMER7_BRKIN2_PB6 \
	GD32_PINMUX_AF('B', 6, AF2)
#define TIMER7_BRKIN2_PE10 \
	GD32_PINMUX_AF('E', 10, AF2)

/* TIMER7_BRKIN3 */
#define TIMER7_BRKIN3_PE0 \
	GD32_PINMUX_AF('E', 0, AF2)
#define TIMER7_BRKIN3_PE9 \
	GD32_PINMUX_AF('E', 9, AF2)

/* TIMER7_CH0 */
#define TIMER7_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF1)
#define TIMER7_CH0_PC10 \
	GD32_PINMUX_AF('C', 10, AF2)
#define TIMER7_CH0_PC12 \
	GD32_PINMUX_AF('C', 12, AF2)
#define TIMER7_CH0_PE13 \
	GD32_PINMUX_AF('E', 13, AF2)
#define TIMER7_CH0_PE14 \
	GD32_PINMUX_AF('E', 14, AF1)

/* TIMER7_CH1 */
#define TIMER7_CH1_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)
#define TIMER7_CH1_PD0 \
	GD32_PINMUX_AF('D', 0, AF2)
#define TIMER7_CH1_PD2 \
	GD32_PINMUX_AF('D', 2, AF1)
#define TIMER7_CH1_PE12 \
	GD32_PINMUX_AF('E', 12, AF1)
#define TIMER7_CH1_PE14 \
	GD32_PINMUX_AF('E', 14, AF2)

/* TIMER7_CH2 */
#define TIMER7_CH2_PB4 \
	GD32_PINMUX_AF('B', 4, AF1)
#define TIMER7_CH2_PE8 \
	GD32_PINMUX_AF('E', 8, AF1)

/* TIMER7_CH3 */
#define TIMER7_CH3_PB2 \
	GD32_PINMUX_AF('B', 2, AF2)
#define TIMER7_CH3_PD7 \
	GD32_PINMUX_AF('D', 7, AF1)

/* TIMER7_MCH0 */
#define TIMER7_MCH0_PC10 \
	GD32_PINMUX_AF('C', 10, AF1)
#define TIMER7_MCH0_PE13 \
	GD32_PINMUX_AF('E', 13, AF1)

/* TIMER7_MCH1 */
#define TIMER7_MCH1_PD1 \
	GD32_PINMUX_AF('D', 1, AF1)
#define TIMER7_MCH1_PE11 \
	GD32_PINMUX_AF('E', 11, AF1)

/* TIMER7_MCH2 */
#define TIMER7_MCH2_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)
#define TIMER7_MCH2_PE7 \
	GD32_PINMUX_AF('E', 7, AF1)

/* TIMER7_MCH3 */
#define TIMER7_MCH3_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)
#define TIMER7_MCH3_PD6 \
	GD32_PINMUX_AF('D', 6, AF1)

/* TIMER_ETI0 */
#define TIMER_ETI0_PB13 \
	GD32_PINMUX_AF('B', 13, AF0)

/* TIMER_ETI1 */
#define TIMER_ETI1_PB6 \
	GD32_PINMUX_AF('B', 6, AF3)

/* TIMER_ETI2 */
#define TIMER_ETI2_PC15 \
	GD32_PINMUX_AF('C', 15, AF0)

/* TIMRE19_BRKIN0 */
#define TIMRE19_BRKIN0_PF2 \
	GD32_PINMUX_AF('F', 2, AF2)

/* TRIGSEL_IN0 */
#define TRIGSEL_IN0_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)

/* TRIGSEL_IN1 */
#define TRIGSEL_IN1_PA2 \
	GD32_PINMUX_AF('A', 2, AF7)

/* TRIGSEL_IN10 */
#define TRIGSEL_IN10_PB11 \
	GD32_PINMUX_AF('B', 11, AF7)

/* TRIGSEL_IN11 */
#define TRIGSEL_IN11_PB12 \
	GD32_PINMUX_AF('B', 12, AF7)

/* TRIGSEL_IN12 */
#define TRIGSEL_IN12_PA15 \
	GD32_PINMUX_AF('A', 15, AF7)

/* TRIGSEL_IN13 */
#define TRIGSEL_IN13_PA11 \
	GD32_PINMUX_AF('A', 11, AF7)

/* TRIGSEL_IN2 */
#define TRIGSEL_IN2_PE13 \
	GD32_PINMUX_AF('E', 13, AF7)

/* TRIGSEL_IN3 */
#define TRIGSEL_IN3_PE14 \
	GD32_PINMUX_AF('E', 14, AF7)

/* TRIGSEL_IN4 */
#define TRIGSEL_IN4_PA8 \
	GD32_PINMUX_AF('A', 8, AF7)

/* TRIGSEL_IN5 */
#define TRIGSEL_IN5_PA9 \
	GD32_PINMUX_AF('A', 9, AF7)

/* TRIGSEL_IN6 */
#define TRIGSEL_IN6_PF2 \
	GD32_PINMUX_AF('F', 2, AF6)

/* TRIGSEL_IN7 */
#define TRIGSEL_IN7_PA7 \
	GD32_PINMUX_AF('A', 7, AF7)

/* TRIGSEL_IN8 */
#define TRIGSEL_IN8_PE11 \
	GD32_PINMUX_AF('E', 11, AF7)

/* TRIGSEL_IN9 */
#define TRIGSEL_IN9_PE12 \
	GD32_PINMUX_AF('E', 12, AF7)

/* TRIGSEL_OUT0 */
#define TRIGSEL_OUT0_PC10 \
	GD32_PINMUX_AF('C', 10, AF7)

/* TRIGSEL_OUT1 */
#define TRIGSEL_OUT1_PE5 \
	GD32_PINMUX_AF('E', 5, AF7)

/* TRIGSEL_OUT2 */
#define TRIGSEL_OUT2_PE4 \
	GD32_PINMUX_AF('E', 4, AF7)

/* TRIGSEL_OUT3 */
#define TRIGSEL_OUT3_PC11 \
	GD32_PINMUX_AF('C', 11, AF7)

/* TRIGSEL_OUT4 */
#define TRIGSEL_OUT4_PC13 \
	GD32_PINMUX_AF('C', 13, AF7)

/* TRIGSEL_OUT5 */
#define TRIGSEL_OUT5_PE6 \
	GD32_PINMUX_AF('E', 6, AF7)

/* TRIGSEL_OUT6 */
#define TRIGSEL_OUT6_PE3 \
	GD32_PINMUX_AF('E', 3, AF12)

