zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32a503v(b-c-d)xx-pinctrl.h
/* TRIGSEL_OUT7 */
#define TRIGSEL_OUT7_PE2 \
	GD32_PINMUX_AF('E', 2, AF7)

/* USART0_CK */
#define USART0_CK_PA12 \
	GD32_PINMUX_AF('A', 12, AF5)

/* USART0_CTS */
#define USART0_CTS_PC11 \
	GD32_PINMUX_AF('C', 11, AF5)
#define USART0_CTS_PD8 \
	GD32_PINMUX_AF('D', 8, AF5)

/* USART0_DE */
#define USART0_DE_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define USART0_DE_PC10 \
	GD32_PINMUX_AF('C', 10, AF5)

/* USART0_RTS */
#define USART0_RTS_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define USART0_RTS_PC10 \
	GD32_PINMUX_AF('C', 10, AF5)

/* USART0_RX */
#define USART0_RX_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define USART0_RX_PA11 \
	GD32_PINMUX_AF('A', 11, AF5)
#define USART0_RX_PB14 \
	GD32_PINMUX_AF('B', 14, AF5)

/* USART0_TX */
#define USART0_TX_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)
#define USART0_TX_PA10 \
	GD32_PINMUX_AF('A', 10, AF5)
#define USART0_TX_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)

/* USART1_CK */
#define USART1_CK_PD5 \
	GD32_PINMUX_AF('D', 5, AF12)

/* USART1_CTS */
#define USART1_CTS_PD4 \
	GD32_PINMUX_AF('D', 4, AF5)
#define USART1_CTS_PD10 \
	GD32_PINMUX_AF('D', 10, AF5)
#define USART1_CTS_PE3 \
	GD32_PINMUX_AF('E', 3, AF12)
#define USART1_CTS_PF5 \
	GD32_PINMUX_AF('F', 5, AF5)

/* USART1_DE */
#define USART1_DE_PD3 \
	GD32_PINMUX_AF('D', 3, AF5)
#define USART1_DE_PD9 \
	GD32_PINMUX_AF('D', 9, AF5)
#define USART1_DE_PE2 \
	GD32_PINMUX_AF('E', 2, AF5)

/* USART1_RTS */
#define USART1_RTS_PD3 \
	GD32_PINMUX_AF('D', 3, AF5)
#define USART1_RTS_PD9 \
	GD32_PINMUX_AF('D', 9, AF5)
#define USART1_RTS_PE2 \
	GD32_PINMUX_AF('E', 2, AF5)

/* USART1_RX */
#define USART1_RX_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)
#define USART1_RX_PD0 \
	GD32_PINMUX_AF('D', 0, AF5)
#define USART1_RX_PD8 \
	GD32_PINMUX_AF('D', 8, AF4)

/* USART1_TX */
#define USART1_TX_PB15 \
	GD32_PINMUX_AF('B', 15, AF4)
#define USART1_TX_PC2 \
	GD32_PINMUX_AF('C', 2, AF5)
#define USART1_TX_PC12 \
	GD32_PINMUX_AF('C', 12, AF5)

/* USART2_CK */
#define USART2_CK_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)

/* USART2_CTS */
#define USART2_CTS_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define USART2_CTS_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define USART2_CTS_PC5 \
	GD32_PINMUX_AF('C', 5, AF5)

/* USART2_DE */
#define USART2_DE_PC4 \
	GD32_PINMUX_AF('C', 4, AF5)
#define USART2_DE_PE15 \
	GD32_PINMUX_AF('E', 15, AF5)
#define USART2_DE_PF2 \
	GD32_PINMUX_AF('F', 2, AF5)

/* USART2_RTS */
#define USART2_RTS_PC4 \
	GD32_PINMUX_AF('C', 4, AF5)
#define USART2_RTS_PE15 \
	GD32_PINMUX_AF('E', 15, AF5)
#define USART2_RTS_PF2 \
	GD32_PINMUX_AF('F', 2, AF5)

/* USART2_RX */
#define USART2_RX_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define USART2_RX_PE1 \
	GD32_PINMUX_AF('E', 1, AF5)
#define USART2_RX_PF4 \
	GD32_PINMUX_AF('F', 4, AF5)

/* USART2_TX */
#define USART2_TX_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define USART2_TX_PE0 \
	GD32_PINMUX_AF('E', 0, AF5)
#define USART2_TX_PF3 \
	GD32_PINMUX_AF('F', 3, AF5)
